Workshops/Workshop 8/StudentsCI/app/Models/StudentModel.php

SELECT `students`.*, `careers`.`name` AS `careers_name`
FROM `students`
LEFT JOIN `careers` ON `students`.`career_id` = `careers`.`id`
---
    public function getStudentsWithCareers()
    {
        return $this->select('students.*, careers.name AS careers_name')
            ->join('careers', 'students.career_id = careers.id', 'left')
            ->findAll();