Workshops/Workshop 8/StudentsCI/app/Controllers/Career.php

    public function index()
    {
        $careerModel = Model(CareerModel::class);
        $data['pageTitle'] = 'Careers Page';

        $data['careers'] = $careerModel->findAll();
---
SELECT *
FROM `careers`

    public function edit($id)
    {
        $careerModel = Model(CareerModel::class);
        $data['career'] = $careerModel->where('id', $id)->first();
---
SELECT *
FROM `careers`
WHERE `id` = '1'
 LIMIT 1

    public function save()
    {
        $careerModel = Model(CareerModel::class);
        $id = $this->request->getVar('id');
        $data = [
            'name' => $this->request->getVar('name')
        ];
        if ($id) {
            $careerModel->update($id, $data);
---
UPDATE `careers` SET `name` = 'Ingenería del Software'
WHERE `careers`.`id` IN ('1')