Workshops/Workshop 8/StudentsCI/app/Controllers/Student.php

    public function create()
    {
        $careerModel = Model(CareerModel::class);

        $data['pageTitle'] = 'Students Page';
        $data['actionTitle'] = 'Create Student';
        $data['careers']     = $careerModel->findAll();;
---
SELECT *
FROM `careers`

    public function edit($id)
    {
        $studentModel = model(StudentModel::class);
        $careerModel  = Model(CareerModel::class);

        $data['student']     = $studentModel->where('id', $id)->first();
        $data['pageTitle']   = 'Students Page';
        $data['actionTitle'] = 'Edit Student';
        $data['careers']     = $careerModel->findAll();
---
SELECT *
FROM `students`
WHERE `id` = '5'
 LIMIT 1
SELECT *
FROM `careers`

    public function save()
    {
        $studentModel = model(StudentModel::class);
        $id = $this->request->getVar('id');
        $data = [
            'name' => $this->request->getVar('name'),
            'last_name'  => $this->request->getVar('last_name'),
            'address'  => $this->request->getVar('address'),
            'career_id'  => $this->request->getVar('career')
        ];
        if ($id) {
            $studentModel->update($id, $data);
        } else {
            $studentModel->insert($data);
---
UPDATE `students` SET `name` = 'Michelle', `last_name` = 'Madrigal', `address` = 'El Sector', `career_id` = '1'
WHERE `students`.`id` IN ('5')
INSERT INTO `students` (`name`, `last_name`, `address`, `career_id`) VALUES ('Michelle', 'Madrigal', 'El Sector = A peligro', '3')

    public function delete($id = null)
    {
        $studentModel = model(StudentModel::class);
        $studentModel->where('id', $id)->delete();
---
DELETE FROM `students`
WHERE `id` = '4'